In [4]:
import pandas as pd
import numpy as np
from datetime import datetime

In [166]:
pd.set_option('display.max_rows', 15)

# Stock and Commodity Values

## Aluminium and Copper

In [282]:
d_parser = lambda x: datetime.strptime(x, '%b-%y')
data_cu_al = pd.read_csv("D:\\finance\\src\\al-cu-price.csv", parse_dates=["Month"], date_parser=d_parser)

In [284]:
data_cu_al["Month"] = data_cu_al["Month"].apply(lambda x: datetime.strftime(x, '%Y-%m'))

data_cu_al.loc[data_cu_al["Aluminum ROC"] == '-', "Aluminum ROC"] = 0
data_cu_al.loc[data_cu_al["Copper, grade A cathode ROC"] == '-', "Copper, grade A cathode ROC"] = 0

data_cu_al["Aluminum ROC"] = data_cu_al["Aluminum ROC"].str.replace(r'%', r'0').astype('float')
data_cu_al["Copper, grade A cathode ROC"] = data_cu_al["Copper, grade A cathode ROC"].str.replace(r'%', r'0').astype('float')

data_cu_al["Aluminum Price (US Dollars per Metric Ton)"] = data_cu_al["Aluminum Price (US Dollars per Metric Ton)"].str.replace(',', '').astype('float')
data_cu_al["Copper, grade A cathode Price (US Dollars per Metric Ton)"] = data_cu_al["Copper, grade A cathode Price (US Dollars per Metric Ton)"].str.replace(',', '').astype('float')

In [322]:
data_cu_al2 = data_cu_al.copy()
data_cu_al2 = data_cu_al2.drop(["Aluminum ROC", "Copper, grade A cathode ROC", "Aluminum / Copper, grade A cathode Price Ratio"], axis=1)
data_cu_al2 = data_cu_al2.rename(columns={"Month" : "Date", "Aluminum Price (US Dollars per Metric Ton)" : "Al", "Copper, grade A cathode Price (US Dollars per Metric Ton)" : "copper2"})
data_cu_al2

        Date       Al  copper2
0    2008-01  2445.52  7061.02
1    2008-02  2776.93  7887.69
2    2008-03  3005.29  8439.29
3    2008-04  2959.27  8684.93
4    2008-05  2902.90  8382.75
..       ...      ...      ...
175  2022-08  2430.79  7981.84
176  2022-09  2224.76  7746.01
177  2022-10  2255.54  7651.08
178  2022-11  2350.72  8049.86
179  2022-12  2401.69  8375.40

[180 rows x 3 columns]

## Copper Historical Values 1959 - Today

In [377]:
d_parser = lambda x: datetime.strptime(x, '%Y-%m-%d')
data_cu = pd.read_csv("D:\\finance\\src\\copper-prices-historical-chart-data.csv", parse_dates=["date"], date_parser=d_parser)
data_cu = data_cu.rename(columns={"date" : "Date"})

data_cu

            Date   value
0     1959-07-02  0.2930
1     1959-07-06  0.2910
2     1959-07-07  0.2820
3     1959-07-08  0.2846
4     1959-07-09  0.2760
...          ...     ...
15954 2023-03-04     NaN
15955 2023-03-05     NaN
15956 2023-03-06     NaN
15957 2023-03-07     NaN
15958 2023-03-08     NaN

[15959 rows x 2 columns]

In [372]:
data_cu.dtypes

Date      datetime64[ns]
 value           float64
dtype: object

In [385]:
df_cu = data_cu.rename(columns={ " value" : "Copper"})
df_cu

            Date  Copper
0     1959-07-02  0.2930
1     1959-07-06  0.2910
2     1959-07-07  0.2820
3     1959-07-08  0.2846
4     1959-07-09  0.2760
...          ...     ...
15954 2023-03-04     NaN
15955 2023-03-05     NaN
15956 2023-03-06     NaN
15957 2023-03-07     NaN
15958 2023-03-08     NaN

[15959 rows x 2 columns]

## Aluminium Historical Values 200 - Today

In [333]:
d_parser = lambda x: datetime.strptime(x, '%m/%d/%Y')
data_al = pd.read_csv("D:\\finance\\src\\Aluminium_Historical_Data.csv", parse_dates=["Date"], date_parser=d_parser)

#Convert volume from string to int
data_al['Vol.'] = data_al['Vol.'].fillna(0)
data_al['Vol.'] = data_al['Vol.'].replace({'K': '*1e3', 'M': '*1e6'}, regex=True).map(pd.eval).astype(int)

#Convert change % to float
data_al["Change %"] = data_al["Change %"].str.replace(r'%', r'0').astype('float')

#Convert $ values to floats
column_list = ["Price", "Open", "High", "Low"]
for column in column_list:
    data_al[column] = data_al[column].str.replace(',', '').astype('float')

data_al

           Date    Price     Open     High      Low   Vol.  Change %
0    2023-02-16  2422.50  2402.00  2424.50  2375.00      0      1.59
1    2023-02-15  2384.50  2398.00  2393.00  2390.50      0     -0.98
2    2023-02-14  2408.00  2420.00  2419.00  2420.00  43630     -0.19
3    2023-02-13  2412.50  2430.00  2424.00  2424.00  54610     -1.15
4    2023-02-10  2440.50  2468.00  2465.00  2465.00  44190     -2.34
...         ...      ...      ...      ...      ...    ...       ...
2190 2014-06-20  1888.50  1888.50  1888.50  1888.50  18510     -0.11
2191 2014-06-19  1890.50  1890.50  1890.50  1890.50  26660      0.85
2192 2014-06-18  1874.50  1874.50  1874.50  1874.50  26120      1.21
2193 2014-06-17  1852.00  1852.00  1852.00  1852.00  45550      0.64
2194 2014-06-16  1840.25  1840.25  1840.25  1840.25  19290      0.34

[2195 rows x 7 columns]

In [363]:
data_al.dtypes

Date        datetime64[ns]
Price              float64
Open               float64
High               float64
Low                float64
Vol.                 int32
Change %           float64
dtype: object

In [387]:
df_al = data_al.drop(["Open", "High", "Low", "Vol.", "Change %"], axis=1)
df_al = df_al.rename(columns={"Price" : "Aluminium"})
df_al

           Date  Aluminium
0    2023-02-16    2422.50
1    2023-02-15    2384.50
2    2023-02-14    2408.00
3    2023-02-13    2412.50
4    2023-02-10    2440.50
...         ...        ...
2190 2014-06-20    1888.50
2191 2014-06-19    1890.50
2192 2014-06-18    1874.50
2193 2014-06-17    1852.00
2194 2014-06-16    1840.25

[2195 rows x 2 columns]

## South32 Ltd Stock Prices

In [388]:
d_parser = lambda x: datetime.strptime(x, '%Y-%m-%d')
data_s32 = pd.read_csv("D:\\finance\\src\\S32-historical-max.csv", parse_dates=["Date"], date_parser=d_parser)

data_s32

           Date  Open  High   Low  Close  Adj Close     Volume
0    2015-05-18  2.13  2.22  2.01   2.05   1.738346  160185286
1    2015-05-19  2.17  2.34  2.16   2.33   1.975779  192730310
2    2015-05-20  2.35  2.37  2.25   2.36   2.001218   59085150
3    2015-05-21  2.35  2.45  2.34   2.37   2.009698   54016569
4    2015-05-22  2.36  2.39  2.30   2.31   1.958820   38646976
...         ...   ...   ...   ...    ...        ...        ...
1959 2023-02-09  4.68  4.72  4.66   4.69   4.690000   13261399
1960 2023-02-10  4.68  4.69  4.58   4.58   4.580000   13638584
1961 2023-02-13  4.60  4.64  4.54   4.58   4.580000   20136910
1962 2023-02-14  4.67  4.68  4.63   4.64   4.640000   13282276
1963 2023-02-15  4.70  4.71  4.60   4.62   4.620000   13954404

[1964 rows x 7 columns]

In [369]:
data_s32.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object

In [391]:
df_s32 = data_s32.drop(["Open", "High", "Low", "Adj Close", "Volume"], axis=1)
df_s32 = df_s32.rename(columns={"Close" : "S32"})
df_s32

           Date   S32
0    2015-05-18  2.05
1    2015-05-19  2.33
2    2015-05-20  2.36
3    2015-05-21  2.37
4    2015-05-22  2.31
...         ...   ...
1959 2023-02-09  4.69
1960 2023-02-10  4.58
1961 2023-02-13  4.58
1962 2023-02-14  4.64
1963 2023-02-15  4.62

[1964 rows x 2 columns]

## BHP ASX Stock Prices

In [402]:
d_parser = lambda x: datetime.strptime(x, '%Y-%m-%d')
data_bhp = pd.read_csv("D:\\finance\\src\\BHP-AX.txt", parse_dates=["Date"], date_parser=d_parser)

data_bhp

,Date,Open,High,Low,Close,Adj Close,Volume
0,1988-02-01,2.295866,2.295866,2.295866,2.295866,0.583026,0.0
1,1988-02-02,2.295866,2.295866,2.295866,2.295866,0.583026,0.0
2,1988-02-03,2.295866,2.295866,2.295866,2.295866,0.583026,0.0
3,1988-02-04,2.295866,2.295866,2.295866,2.295866,0.583026,0.0
4,1988-02-05,2.295866,2.295866,2.295866,2.295866,0.583026,0.0
...,...,...,...,...,...,...,...
8994,2023-02-13,47.779999,48.020000,47.630001,47.869999,47.869999,7354717.0
8995,2023-02-14,47.990002,48.200001,47.650002,47.720001,47.720001,5799869.0
8996,2023-02-15,48.200001,48.250000,47.570000,47.939999,47.939999,6687104.0
8997,2023-02-16,47.990002,48.299999,47.759998,48.119999,48.119999,14993848.0
8998,2023-02-16,47.990002,48.299999,47.759998,48.119999,48.119999,13031704.0

In [403]:
data_bhp.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume              float64
dtype: object

In [404]:
df_bhp = data_bhp.drop(["Open", "High", "Low", "Adj Close", "Volume"], axis=1)
df_bhp = df_bhp.rename(columns={"Close" : "BHP"})

df_bhp

           Date        BHP
0    1988-02-01   2.295866
1    1988-02-02   2.295866
2    1988-02-03   2.295866
3    1988-02-04   2.295866
4    1988-02-05   2.295866
...         ...        ...
8994 2023-02-13  47.869999
8995 2023-02-14  47.720001
8996 2023-02-15  47.939999
8997 2023-02-16  48.119999
8998 2023-02-16  48.119999

[8999 rows x 2 columns]

# Analysis

## Combine Multiple Dataframes

In [405]:
import functools as ft

dfs = [df_cu, df_al, df_s32, df_bhp]

df_final = ft.reduce(lambda left, right: pd.merge(left, right, on='Date'), dfs)

In [406]:
df_final.corr()

             Copper  Aluminium       S32       BHP
Copper     1.000000   0.916406  0.693214  0.826754
Aluminium  0.916406   1.000000  0.808676  0.682061
S32        0.693214   0.808676  1.000000  0.643757
BHP        0.826754   0.682061  0.643757  1.000000

### Old code

In [358]:
combined = pd.merge(data_s32, data_cu, how="inner")
combined['Date'] = pd.to_datetime(combined['Date'])
combined = combined.drop(["Open", "High", "Low", "Adj Close", "Volume"], axis=1)
combined = combined.rename(columns={"Close" : "S32", " value" : "Copper"})

In [345]:
combined.corr()

,Open,High,Low,s32,Adj Close,Volume,copper 1
Open,1.000000,0.999361,0.999341,0.998536,0.990679,-0.098637,0.696240
High,0.999361,1.000000,0.999332,0.999400,0.991542,-0.088810,0.695380
Low,0.999341,0.999332,1.000000,0.999417,0.991020,-0.104605,0.694654
s32,0.998536,0.999400,0.999417,1.000000,0.991605,-0.095509,0.694504
Adj Close,0.990679,0.991542,0.991020,0.991605,1.000000,-0.110536,0.742036
Volume,-0.098637,-0.088810,-0.104605,-0.095509,-0.110536,1.000000,-0.161596
copper 1,0.696240,0.695380,0.694654,0.694504,0.742036,-0.161596,1.000000

In [348]:
[combined.dtypes, data_al.dtypes]

[Date        datetime64[ns]
 s32                float64
 copper 1           float64
 dtype: object,
 Date        datetime64[ns]
 Price              float64
 Open               float64
 High               float64
 Low                float64
 Vol.                 int32
 Change %           float64
 dtype: object]

In [359]:
data_al_copy = data_al.copy()
data_al_copy = data_al_copy.drop(["Low", "Open", "High", "Vol.", "Change %"], axis=1)
data_al_copy = data_al_copy.rename(columns={"Price" : "Aluminium"})
combined2 = pd.merge(combined, data_al_copy, how="inner")

In [357]:
combined2.corr()

                  s32  copper 1  aluminium 1
s32          1.000000  0.693214     0.808676
copper 1     0.693214  1.000000     0.916406
aluminium 1  0.808676  0.916406     1.000000

In [189]:
combined2.tail(10)

         Date   s32  copper 1
1913  2023-02  4.72    4.0944
1914  2023-02  4.68    4.0384
1915  2023-02  4.61    4.0464
1916  2023-02  4.64    4.0768
1917  2023-02  4.74    4.0544
1918  2023-02  4.69    4.0768
1919  2023-02  4.58    4.0256
1920  2023-02  4.58    4.0720
1921  2023-02  4.64    4.1008
1922  2023-02  4.62    4.0960

In [190]:
combined2.groupby(['Date'], as_index=False).mean()

       Date       s32  copper 1
0   2015-05  2.260000  2.808278
1   2015-06  2.019048  2.653876
2   2015-07  1.778636  2.477636
3   2015-08  1.607381  2.326500
4   2015-09  1.528810  2.363429
..      ...       ...       ...
89  2022-10  3.728095  3.424152
90  2022-11  3.969545  3.656582
91  2022-12  4.147000  3.816640
92  2023-01  4.494000  4.125280
93  2023-02  4.648182  4.078982

[94 rows x 3 columns]

In [208]:
combined2.dtypes

Date         object
s32         float64
copper 1    float64
dtype: object

# New

In [2]:
%%capture
!pip install yfinance

import yfinance as yf
import functools as ft

Collecting yfinance
  Downloading yfinance-0.2.12-py2.py3-none-any.whl (59 kB)
     ---------------------------------------- 59.2/59.2 kB 1.5 MB/s eta 0:00:00
Collecting multitasking>=0.0.7
  Downloading multitasking-0.0.11-py3-none-any.whl (8.5 kB)
Collecting frozendict>=2.3.4
  Downloading frozendict-2.3.5-cp39-cp39-win_amd64.whl (35 kB)
Collecting pytz>=2022.5
  Downloading pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
     -------------------------------------- 499.4/499.4 kB 6.3 MB/s eta 0:00:00
Collecting html5lib>=1.1
  Using cached html5lib-1.1-py2.py3-none-any.whl (112 kB)
Requirement already satisfied: lxml>=4.9.1 in d:\anaconda3\lib\site-packages (from yfinance) (4.9.1)
Requirement already satisfied: pandas>=1.3.0 in d:\anaconda3\lib\site-packages (from yfinance) (1.4.4)
Requirement already satisfied: appdirs>=1.4.4 in d:\anaconda3\lib\site-packages (from yfinance) (1.4.4)
Requirement already satisfied: numpy>=1.16.5 in d:\anaconda3\lib\site-packages (from yfinance) (1.21.5)
Requirement already satisfied: beautifulsoup4>=4.11.1 in d:\anaconda3\lib\site-packages (from yfinance) (4.11.1)
Requirement already satisfied: cryptography>=3.3.2 in d:\anaconda3\lib\site-packages (from yfinance) (37.0.1)
Requirement already satisfied: requests>=2.26 in d:\anaconda3\lib\site-packages (from yfinance) (2.28.1)
Requirement already satisfied: soupsieve>1.2 in d:\anaconda3\lib\site-packages (from beautifulsoup4>=4.11.1->yfinance) (2.3.1)
Requirement already satisfied: cffi>=1.12 in d:\anaconda3\lib\site-packages (from cryptography>=3.3.2->yfinance) (1.15.1)
Requirement already satisfied: six>=1.9 in d:\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (1.16.0)
Requirement already satisfied: webencodings in d:\anaconda3\lib\site-packages (from html5lib>=1.1->yfinance) (0.5.1)
Requirement already satisfied: python-dateutil>=2.8.1 in d:\anaconda3\lib\site-packages (from pandas>=1.3.0->yfinance) (2.8.2)
Requirement already satisfied: charset-normalizer<3,>=2 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (2.0.4)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (1.26.11)
Requirement already satisfied: idna<4,>=2.5 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (3.3)
Requirement already satisfied: certifi>=2017.4.17 in d:\anaconda3\lib\site-packages (from requests>=2.26->yfinance) (2022.9.14)
Requirement already satisfied: pycparser in d:\anaconda3\lib\site-packages (from cffi>=1.12->cryptography>=3.3.2->yfinance) (2.21)
Installing collected packages: pytz, multitasking, html5lib, frozendict, yfinance
  Attempting uninstall: pytz
    Found existing installation: pytz 2022.1
    Uninstalling pytz-2022.1:
      Successfully uninstalled pytz-2022.1
Successfully installed frozendict-2.3.5 html5lib-1.1 multitasking-0.0.11 pytz-2022.7.1 yfinance-0.2.12

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
conda-repo-cli 1.0.20 requires clyent==1.2.1, but you have clyent 1.2.2 which is incompatible.
conda-repo-cli 1.0.20 requires nbformat==5.4.0, but you have nbformat 5.5.0 which is incompatible.

In [107]:
def reduce(commodity, name, *argv):
    commodity[name + ' price'] = commodity["Close"]
    column_list = [name + ' price'] + [arg for arg in argv]
    return commodity[column_list]

In [108]:
TODAY = datetime.today().strftime('%Y-%m-%d')
START = '2015-01-01'
END = TODAY
mineral_codes = {"Gold" : "GC=F", "Silver" : "SI=F", "Platinum" : "PL=F", "Copper" : "HG=F", "Palladium" : "PA=F", "Crude Oil" : "CL=F", "Heating Oil" : "HO=F", "Natural Gas" : "NG=F"}

In [105]:
mineral_futures_prices = {mineral : yf.download(code, START, END)  for mineral, code in mineral_codes.items()}

[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed
[*********************100%***********************]  1 of 1 completed

In [109]:
mineral_futures_price_only = [reduce(mineral_futures_prices[mineral], mineral) for mineral in mineral_futures_prices.keys()]

In [110]:
df_final = ft.reduce(lambda left, right: pd.merge(left, right, on='Date'), mineral_futures_price_only)

In [111]:
df_final.corr()

,Gold price,Silver price,Platinum price,Copper price,Palladium price,Crude Oil price,Heating Oil price,Natural Gas price
Gold price,1.000000,0.860668,0.154541,0.748581,0.911721,0.435235,0.408500,0.406583
Silver price,0.860668,1.000000,0.504973,0.772303,0.762349,0.391952,0.297800,0.326785
Platinum price,0.154541,0.504973,1.000000,0.333293,0.099134,0.138506,0.067298,0.039834
Copper price,0.748581,0.772303,0.333293,1.000000,0.729096,0.750733,0.662041,0.585395
Palladium price,0.911721,0.762349,0.099134,0.729096,1.000000,0.405847,0.366445,0.330920
Crude Oil price,0.435235,0.391952,0.138506,0.750733,0.405847,1.000000,0.946528,0.791389
Heating Oil price,0.408500,0.297800,0.067298,0.662041,0.366445,0.946528,1.000000,0.842280
Natural Gas price,0.406583,0.326785,0.039834,0.585395,0.330920,0.791389,0.842280,1.000000